### Filtering & Conditional Logic

In [2]:
import pandas as pd
import numpy as np

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'age': [25, 32, 28, 45, 22],
    'salary': [50000, 60000, 40000, 80000, 30000],
    'department': ['HR', 'Finance', 'IT', 'Finance', 'HR'],
    'gender': ['Female', 'Male', 'Male', 'Male', 'Female']
}

df = pd.DataFrame(data)

In [38]:
#  Example 1 â€“ Filter salary > 50k:
# print(df)
df[df['salary'] > 50000]

# Finance department AND salary > 50k:
df[(df['salary'] > 5000) & (df['department'] == 'Finance')]

# Not in HR:
df[df['department'] != 'HR']
df[~df['department'].isin(['HR'])]

# Add new column: high_salary
df['High_Salary'] = df['salary'] + 5000
print(df)

# Add new column with np.where
df['category'] = np.where(df['salary'] > 50000,'High','Low')
print("\n",df)

#  Optional: Use query() for readability
# df.query("\nsalary > 50000 and department == 'Finance'")
df.query("department != 'HR'")

      name  age  salary department  gender  High_Salary category
0    Alice   25   50000         HR  Female        55000      Low
1      Bob   32   60000    Finance    Male        65000     High
2  Charlie   28   40000         IT    Male        45000      Low
3    David   45   80000    Finance    Male        85000     High
4      Eva   22   30000         HR  Female        35000      Low

       name  age  salary department  gender  High_Salary category
0    Alice   25   50000         HR  Female        55000      Low
1      Bob   32   60000    Finance    Male        65000     High
2  Charlie   28   40000         IT    Male        45000      Low
3    David   45   80000    Finance    Male        85000     High
4      Eva   22   30000         HR  Female        35000      Low

      name  age  salary department gender  High_Salary category
1      Bob   32   60000    Finance   Male        65000     High
2  Charlie   28   40000         IT   Male        45000      Low
3    David   45   80000    Finance   Male        85000     High